---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamilyShared
source: html/1b89233e-8ab3-90ec-394d-e9795a8a5a94.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamilyShared Property

While loading shared family '[Family Name]' from family '[Family Name]': [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId WhileLoadingFamilyShared { get; }
```